# -*- coding: utf-8 -*-
# @Time    : 12/24/19 10:07 AM
# @Author  : Yippee Song
# @Software: PyCharm

'''
给定 n 个非负整数 a1，a2，...，an，每个数代表坐标中的一个点 (i, ai) 。在坐标内画 n 条垂直线，垂直线 i 的两个端点分别为 (i, ai) 和 (i, 0)。找出其中的两条线，使得它们与 x 轴共同构成的容器可以容纳最多的水。

说明：你不能倾斜容器，且 n 的值至少为 2。


""""""""""""""""""""""""""""""""""""""""""""""""""
""""""""""""""""""""""""""""""""""""""""""""""""""
"""""""""$"""""""""""""""""""""""""$""""""""""""""
"""""""""$"""""""""""""""""""""""""$""""""""""""""
"""""""""$|||||||||||||||||||||||||$|||||||||$""""
"""""""""$|||||||||||||||||||||||||$|||||||||$""""
"""""""""$|||||$|||||||||||||||||||$|||||||||$""""
"""""""""$|||||$|||||||||||||||||||$|||||||||$""""
"""""""""$|||||$|||||||||$|||||||||$|||||||||$""""
"""""""""$|||||$|||||||||$|||||||||$|||||||||$""""
"""""""""$|||||$|||||||||$||||$||||$|||||||||$""""
"""""""""$|||||$|||||||||$||||$||||$|||||||||$""""
"""""""""$|||||$|||||||||$||||$||||$||||$||||$""""
"""""""""$|||||$|||||||||$||||$||||$||||$||||$""""
"""""""""$|||||$||||$||||$||||$||||$||||$||||$""""
"""""""""$|||||$||||$||||$||||$||||$||||$||||$""""
"""""$"""$|||||$||||$||||$||||$||||$||||$||||$""""
"""""$"""$|||||$||||$||||$||||$||||$||||$||||$""""
"""""1"""8"""""6""""2""""5""""4""""8""""3""""7""""
图中垂直线代表输入数组 [1,8,6,2,5,4,8,3,7]。在此情况下，容器能够容纳水（表示为 | 部分）的最大值为 49。

示例:
输入: [1,8,6,2,5,4,8,3,7]
输出: 49

来源：力扣（LeetCode）
链接：https://leetcode-cn.com/problems/container-with-most-water
著作权归领扣网络所有。商业转载请联系官方授权，非商业转载请注明出处。

'''


class Solution(object):
    def maxArea(self, height):
        """
        :type height: List[int]
        :rtype: int
        """
        if not height or len(height) < 2:
            return 0
        else:
            i = 0
            j = len(height) - 1
            max_water = 0
            while i < j:
                square = min(height[i], height[j]) * (j - i)
                if square > max_water:
                    max_water = square
                if height[i] < height[j]:
                    i += 1
                else:
                    j -= 1

            return max_water


if __name__ == '__main__':
    nums = [1, 8, 6, 2, 5, 4, 8, 3, 7]
    print Solution().maxArea(nums)
